s = 'объектно-ориентированный'

print(s[0:6])                                                   # объект
print(s[9:17])                                                  # ориентир
print(s[14:17])                                                 # тир
print(s[9:11])                                                  # ор
print(s[16:19])                                                 # ров
print(s[4] + s[0] + s[5])                                       # кот
print(s[10] + s[3] + s[6] + s[5] + s[-5])                       # рента
print(s[5] + s[0] + s[4])                                       # ток
print(s[0] + s[1] + s[7] + s[11])                               # обои
print(s[10] + s[0] + s[5])                                      # рот
print(s[5] + s[0] + s[10] + s[14])                              # торт
print(s[-6] + s[3] + s[12] + s[-8])                             # веер
print(s[-4:-7:-1] + s[-2] + s[4])                               # навык
print(s[5] + s[7] + s[6])                                       # тон
print(s[3] + s[6] + s[7] + s[5])                                # енот
print(s[-6] + s[3] + s[6] + s[-5])                              # вена
print(s[-6] + s[-9] + s[6] + s[-5])                             # вина
print(s[5] + s[7] + s[6] + s[6] + s[-5])                        # тонна
print(s[0] + s[4] + s[6] + s[7])                                # окно
print(s[6] + s[3] + s[1] + s[7])                                # небо
print(s[1] + s[3] + s[4] + s[7] + s[6])                         # бекон
print(s[1] + s[3] + s[5] + s[7] + s[6])                         # бетон
print(s[5] + s[16] + s[7] + s[6])                               # трон
print(s[11] + s[-6] + s[-5])                                    # ива
print(s[-6:15:-1])                                              # вор
print(s[18:15:-1] + s[7:5:-1])                                  # ворон
print(s[18:15:-1] + s[7:5:-1] + s[-5])                          # ворона
print(s[6] + s[0] + s[16] + s[-5])                              # нора
print(s[16] + s[0] + s[4])                                      # рок
print(s[6] + s[0] + s[5] + s[-5])                               # нота
print(s[1] + s[-5] + s[16])                                     # бар
print(s[16] + s[-5] + s[1])                                     # раб
print(s[16] + s[0] + s[1] + s[-5])                              # роба
print(s[16] + s[0] + s[1] + s[7] + s[5])                        # робот
print(s[5] + s[-9] + s[-8] + s[-5] + s[6])                      # тиран
print(s[-6:15:-1] + s[7] + s[5])                                # ворот
print(s[-6:15:-1] + s[7] + s[5] + s[-5])                        # ворота
print(s[5] + s[0] + s[-6] + s[-5] + s[16])                      # товар
print(s[5] + s[3] + s[6] + s[14])                               # тент
print(s[10] + s[-5] + s[-8] + s[-9] + s[5] + s[3] + s[14])      # раритет
print(s[4] + s[-5] + s[16] + s[5] + s[7] + s[6])                # картон